# файл - именнованая областьь данных на носителе информации

# 1. открытие файла
# 2. обработка файла
# 3. закрытие файла


# абсолютные и относительные пути файлов
# абсолютный путь - полный путь к файлу на компьютере
# абсоютный путь начинается с точки монтирования
# linux/mac путь начинается с /
# winsows путь начинается с буквы диска (например C:)

# относительный путь строиться относительно какого-то родительского пути
# допустим есть файл по адресу:
"\home\maks\Work\top-academy\python 319\.scripts\lesson 20\API Movie (Flask)\venv\bin\activate"
# мы находимся в папке
"\home\maks\Work\top-academy\python 319\.scripts\lesson 20\API Movie (Flask)"
# относительный путь до файла activate будет:
"\venv\bin\activate"