x = 3
x1 = 1
x_y = 10

1x = 1  # идентификатор не может начинаться с числа
_x = 1  # правильное и со стилистической точки зрения и с точки зрения интерпретатора

firstVariable = 10  # правильное название с точки зрения языка, но не подходящее стилистически
first_variable = 10  # правильное и со стилистической точки зрения и с точки зрения интерпретатора

list_of_3_elements = [1, 2 ,3]  # правильное и со стилистической точки зрения и с точки зрения интерпретатора
listOf3Elements = [1, 2 ,3]  # правильное название с точки зрения языка, но не подходящее стилистически
FIRSTVARIABLE = 10  # констатнта, но не на уровне языка, а на уровне соглашения программистов
