# Представьте, что у нас есть список целых чисел неограниченной вложенности.
# То есть наш список может состоять из списков, внутри которых также могут быть списки.
# Ваша задача превратить все это в линейный список при помощи функции flatten

# Вход
# [1, [2, 3, [4]], 5]
# Выход
# [1, 2, 3, 4, 5]

# Вход
# [1, [2, 3], [[2], 5], 6]
# Выход
# [1, 2, 3, 2, 5, 6]

# Вход
# [[[[9]]], [1, 2], [[8]]]
# Выход
# [9, 1, 2, 8]


def flatten(l: list) -> list:
    if not isinstance(l, list) and not isinstance(l, tuple):  # базовый случай, мы нашли число и возвращаем список с одним элементом - числом
        return [l]
    elif len(l) == 1:
        return flatten(l[0])
    else:
        return flatten(l[0]) + flatten(l[1:])

print(flatten([1, [2, 3], [[2], 5, (1, 2, 3)], 6]))
print(flatten([[[[9]]], [1, 2], [[8]]]))
print(flatten([1, [2, 3], [[2], 5], 6]))
print(flatten([None, [[[[[[[[[[9]]]], True]]]]]]]))
print(flatten([1, [2, 3], [[2], 5, 1.1], 'a']))

# [1, [2, 3, [4]], 5]

1
[[2, 3, [4]], 5]

[1]

[2, 3, [4]]
[5]

[1] [2] [3] [4] [5]
[1, 2, 3, 4, 5]
