d1 = [1, 2, 3, 4, 5]
d2 = [10, 20, 30, 40, 50]
d3 = [100, 200, 300, 400, 500]
# [111, 222, 333, 444, 555]

# map(func, *iterables) - сигнатура функции
# функция которая применяет функцию func к каждому элементу из iterables

def f(a, b, c):
    return a + b + c

print(list(map(f, d1, d2, d3)))
# f(a=1, b=10, c=100)
# f(a=2, b=20, c=200)
# f(a=3, b=30, c=300)
# f(a=4, b=40, c=400)
# f(a=5, b=50, c=500)

# кратчайший объект будет ограничетелем
d1 = [1, 2, 3, 4]
d2 = [10, 20, 30, 40, 50]
d3 = [100, 200, 300, 400, 500]
# [111, 222, 333, 444]


# кратчайший объект будет ограничетелем
d1 = [1, 2, 3, 4]
d2 = [10, 20, 30]
d3 = [100, 200, 300, 400, 500]
# [111, 222, 333]


print(list(map(lambda x, y, z: x + y + z, d1, d2, d3)))