s = {10000, 1, 2, 5, 10000, 5, 5, 9000, 7, 8, 1}

s
# {10000, 1, 2, 5, 7, 9000, 8}
type(s)
# <class 'set'>
# s[0]
# Traceback (most recent call last):
#   File "<stdin>", line 1, in <module>
# TypeError: 'set' object is not subscriptable

for i in s:
    print(i)

# неизменяемое множество можно задать только функцией
f_s = frozenset((10000, 1, 2, 5, 10000, 5, 5, 9000, 7, 8, 1))
f_s
# frozenset({1, 2, 5, 7, 9000, 8, 10000})

abs_list = [1,11,1,1,1,1,111,23,12,123,44,112,23,123,1123,312,123,12,12,12312,12]
abs_list
# [1, 11, 1, 1, 1, 1, 111, 23, 12, 123, 44, 112, 23, 123, 1123, 312, 123, 12, 12, 12312, 12]
list(set(abs_list))
# [1, 1123, 11, 12, 44, 111, 112, 23, 312, 12312, 123]
